In [34]:
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

In [35]:
dataset = pd.read_csv("airlines_flights_data.csv")
dataset

,index,airline,flight,source_city,departure_time,stops,arrival_time,destination_city,class,duration,days_left,price
0,0,SpiceJet,SG-8709,Delhi,Evening,zero,Night,Mumbai,Economy,2.17,1.0,5953.0
1,1,SpiceJet,SG-8157,Delhi,Early_Morning,zero,Morning,Mumbai,Economy,2.33,1.0,5953.0
2,2,AirAsia,I5-764,Delhi,Early_Morning,zero,Early_Morning,Mumbai,Economy,2.17,1.0,5956.0
3,3,Vistara,UK-995,Delhi,Morning,zero,Afternoon,Mumbai,Economy,2.25,1.0,5955.0
4,4,Vistara,UK-963,Delhi,Morning,zero,Morning,Mumbai,Economy,2.33,1.0,5955.0
...,...,...,...,...,...,...,...,...,...,...,...,...
1589,300148,Vistara,UK-822,Chennai,NaN,one,Evening,Hyderabad,Business,NaN,NaN,69265.0
1590,300149,Vistara,UK-826,NaN,Afternoon,one,Night,Hyderabad,Business,NaN,NaN,NaN
1591,300150,Vistara,UK-832,Chennai,Early_Morning,one,Night,Hyderabad,Business,NaN,NaN,79099.0
1592,300151,Vistara,UK-828,Chennai,Early_Morning,one,Evening,Hyderabad,Business,NaN,NaN,81585.0
1593,300152,Vistara,UK-822,Chennai,Morning,one,Evening,Hyderabad,Business,NaN,49.0,NaN

In [36]:
dataset.isnull().sum()

index                0
airline             38
flight               0
source_city         29
departure_time      39
stops               29
arrival_time        75
destination_city    42
class               10
duration            15
days_left           11
price               18
dtype: int64

In [37]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1594 entries, 0 to 1593
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   index             1594 non-null   int64
 1   airline           1556 non-null   object
 2   flight            1594 non-null   object
 3   source_city       1565 non-null   object
 4   departure_time    1555 non-null   object
 5   stops             1565 non-null   object
 6   arrival_time      1519 non-null   object
 7   destination_city  1552 non-null   object
 8   class             1584 non-null   object
 9   duration          1579 non-null   float64
 10  days_left         1583 non-null   float64
 11  price             1576 non-null   float64
dtypes: float64(3), int64(1), object(8)
memory usage: 149.6+ KB

In [38]:
dataset.select_dtypes(include="float64").columns

Index(['duration', 'days_left', 'price'], dtype='object')

In [39]:
%pip install scikit-learn

Requirement already satisfied: scikit-learn in /home/codespace/.local/lib/python3.12/site-packages (1.7.0)
Requirement already satisfied: numpy>=1.22.0 in /home/codespace/.local/lib/python3.12/site-packages (from scikit-learn) (2.3.1)
Requirement already satisfied: scipy>=1.8.0 in /home/codespace/.local/lib/python3.12/site-packages (from scikit-learn) (1.16.0)
Requirement already satisfied: joblib>=1.2.0 in /home/codespace/.local/lib/python3.12/site-packages (from scikit-learn) (1.5.1)
Requirement already satisfied: threadpoolctl>=3.1.0 in /home/codespace/.local/lib/python3.12/site-packages (from scikit-learn) (3.6.0)

[notice] A new release of pip is available: 25.1.1 -> 25.2
[notice] To update, run: python -m pip install --upgrade pip
Note: you may need to restart the kernel to use updated packages.

In [40]:
from sklearn.impute import SimpleImputer

we can change the strategy to mean, median, mode

In [41]:
si = SimpleImputer(strategy="mean")
ar = si.fit_transform(dataset[['duration', 'days_left', 'price']])
ar

array([[2.17000000e+00, 1.00000000e+00, 5.95300000e+03],
       [2.33000000e+00, 1.00000000e+00, 5.95300000e+03],
       [2.17000000e+00, 1.00000000e+00, 5.95600000e+03],
       ...,
       [1.09684991e+01, 1.59576753e+01, 7.90990000e+04],
       [1.09684991e+01, 1.59576753e+01, 8.15850000e+04],
       [1.09684991e+01, 4.90000000e+01, 1.52303452e+04]], shape=(1594, 3))

In [42]:
new_dataset=pd.DataFrame(ar,columns=dataset.select_dtypes(include="float64").columns)

In [43]:
new_dataset

       duration  days_left         price
0      2.170000   1.000000   5953.000000
1      2.330000   1.000000   5953.000000
2      2.170000   1.000000   5956.000000
3      2.250000   1.000000   5955.000000
4      2.330000   1.000000   5955.000000
...         ...        ...           ...
1589  10.968499  15.957675  69265.000000
1590  10.968499  15.957675  15230.345178
1591  10.968499  15.957675  79099.000000
1592  10.968499  15.957675  81585.000000
1593  10.968499  49.000000  15230.345178

[1594 rows x 3 columns]

In [44]:
dataset["duration"].mean()

np.float64(10.968499050031665)